# ExternalResourceBrowserData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceBrowserData Properties
ExternalResourceBrowserData Class See Also
---
The ExternalResourceBrowserData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FolderPath | The current folder path to which the new resources and subfolder belong. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ServerId | The Id of IExternalResourceServer which handles the external resource load. |

# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace